<details><summary>Show Plan</summary>
```

module.database_cluster.random_password.master_password[0]: Refreshing state... [id=none]
module.database_cluster.random_id.snapshot_identifier[0]: Refreshing state... [id=g8r2jg]
data.assert_test.workspace: Reading...
data.assert_test.workspace: Read complete after 0s
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-9d5a7caf-e591-4fc3-9b8b-395ecc554a78]
data.aws_ecr_repository.repository: Reading...
module.database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0cf37ffc0ce81b1aa]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03d2024cd76f87de7]
module.database_cluster.data.aws_partition.current: Reading...
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/993d657a-e7b6-4d42-8beb-118cd92b4169]
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging-push_logs]
module.database_cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging-push-ecs-task-execution-role]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging-push]
data.aws_ecr_repository.repository: Read complete after 0s [id=echo-server]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310106100000002]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310626000000005]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310513400000004]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_xray_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310311900000003]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 0s [id=Z04987691W18X63LDNXVM]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z015534219WC3CN5D4OW8__a9de1ed1454ebf3b777b54af08986578.staging.push.walletconnect.com._CNAME]
module.database_cluster.aws_security_group.this[0]: Refreshing state... [id=sg-0e16ed5ca4c08ad1f]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0481f853db59b18ab]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-push-target-group/4e313fa6a28675a6]
module.ecs.aws_security_group.lb_ingress: Refreshing state... [id=sg-09a393bfda92ce73c]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0237d5132685aec74]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-030e538b0cb0a6d8e]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-070f71778957ad172]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01b56529aabb62ca4]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-020d4227523193719]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-096e43f33feb7bad8]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00c3da4dd2356a722]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0dabd56e1ee9f13d5]
module.database_cluster.aws_security_group_rule.cidr_ingress[0]: Refreshing state... [id=sgrule-804588316]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-061e6ac209de357b8]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-03e6492222243f584]
module.database_cluster.aws_db_subnet_group.this[0]: Refreshing state... [id=staging-push-database]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-00ddd51caea6541c4]
module.ecs.aws_security_group.app_ingress: Refreshing state... [id=sg-0204db9e1b9eeeade]
module.ecs.aws_lb.application_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-push-load-balancer/aea5ef9d0a34453a]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f4d707d2387daf8d]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07621fa7fde207073]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-089e0e3b3a4cf63c2]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01b56529aabb62ca41080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0210fd7627e6a6303]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-070f71778957ad1721080289494]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-push-load-balancer/aea5ef9d0a34453a/171b42a3340fa814]
module.ecs.aws_lb_listener.listener-http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-push-load-balancer/aea5ef9d0a34453a/b671fd955200d192]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z015534219WC3CN5D4OW8_staging.push.walletconnect.com_A]
module.database_cluster.aws_rds_cluster.this[0]: Refreshing state... [id=staging-push-database]
module.database_cluster.aws_rds_cluster_instance.this["1"]: Refreshing state... [id=staging-push-database-1]
module.ecs.aws_ecs_task_definition.app_task_definition: Refreshing state... [id=staging-push]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.dns.aws_acm_certificate.domain_certificate must be replaced
+/- resource "aws_acm_certificate" "domain_certificate" {
      ~ arn                       = "arn:aws:acm:eu-central-1:898587786287:certificate/993d657a-e7b6-4d42-8beb-118cd92b4169" -> (known after apply)
      ~ domain_name               = "staging.push.walletconnect.com" -> "staging.echo.walletconnect.com" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "staging.push.walletconnect.com"
              - resource_record_name  = "_a9de1ed1454ebf3b777b54af08986578.staging.push.walletconnect.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_91c54269fbeb66f8a62c7bf3ed8ca262.bkngfjypgb.acm-validations.aws."
            },
            # (1 unchanged element hidden)
        ]
      ~ id                        = "arn:aws:acm:eu-central-1:898587786287:certificate/993d657a-e7b6-4d42-8beb-118cd92b4169" -> (known after apply)
      ~ not_after                 = "2023-11-11T23:59:59Z" -> (known after apply)
      ~ not_before                = "2022-10-13T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "staging.echo.walletconnect.com",
          - "staging.push.walletconnect.com",
        ]
      - tags                      = {} -> null
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.dns.aws_route53_record.cert_verification[0] will be created
  + resource "aws_route53_record" "cert_verification" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = "Z04987691W18X63LDNXVM"
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service"
        name                               = "staging-push-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:2" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:2" -> (known after apply)
      ~ container_definitions    = (sensitive) # forces replacement
      ~ id                       = "staging-push" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
      - task_role_arn            = "" -> null
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_lb_listener.listener will be updated in-place
  ~ resource "aws_lb_listener" "listener" {
      ~ certificate_arn   = "arn:aws:acm:eu-central-1:898587786287:certificate/993d657a-e7b6-4d42-8beb-118cd92b4169" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-push-load-balancer/aea5ef9d0a34453a/171b42a3340fa814"
        tags              = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_route53_record.dns_load_balancer will be created
  + resource "aws_route53_record" "dns_load_balancer" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.echo.walletconnect.com"
      + type            = "A"
      + zone_id         = "Z04987691W18X63LDNXVM"

      + alias {
          + evaluate_target_health = true
          + name                   = "staging-push-load-balancer-1585527513.eu-central-1.elb.amazonaws.com"
          + zone_id                = "Z215JYRZR1TBD5"
        }
    }

Plan: 4 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```
</details>
*Action: `pull_request`*